<a href="https://colab.research.google.com/github/randiijulian/Zenius-ML/blob/main/Day6HW_Randi_Julian_Saputra.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##Assignment Python for Data Analysis: Data Manipulation with Pandas

###1. 
Creating Dataframe from Dictionary of List

import library yang dibutuhkan

In [ ]:
import pandas as pd
import numpy as np

membuat dataframe

In [ ]:
df1 = pd.DataFrame({
    "name": ["Anna", "Dane", "David", "Kevin", "Joe", "Rose"], #Columns 1
    "weight": [45.2, 50.5, 62.1, 64.0, 59.0, np.nan], #Columns 2
    "height": [155, 160, 162, 170, 167, 159], #Columns 3
    "birth_year": [2000, 1997, 1996, 1987, 1998, 2003], #Columns 4
    "gender": ["female", "male", "male", "male", "male", "female"], #Columns 5
    "city": ["New York", "Chicago", "Austin", "New York", np.nan, "New York"] #Columns 6
})
df1

    name  weight  height  birth_year  gender      city
0   Anna    45.2     155        2000  female  New York
1   Dane    50.5     160        1997    male   Chicago
2  David    62.1     162        1996    male    Austin
3  Kevin    64.0     170        1987    male  New York
4    Joe    59.0     167        1998    male       NaN
5   Rose     NaN     159        2003  female  New York

###2. 
Create another Pandas DataFrame as the following and merge it with the previous DataFrame (key=name and nick name). Make sure that no rows are missing from the original DataFrame

membuat dataframe tambahan

In [ ]:
df2 = pd.DataFrame({
    "nick_name": ["Anna", "David", "Dane", "Rose"], #Columns 1
    "full_name": ["Anna Levis", "David John","Dane Sebastian", "Rose Kimberly"], #Columns 5
})
df2

  nick_name       full_name
0      Anna      Anna Levis
1     David      David John
2      Dane  Dane Sebastian
3      Rose   Rose Kimberly

menggabungkan kedua dataframe

In [ ]:
df3 = df1.merge(df2, how = "left", left_on = "name", right_on = "nick_name")
df3

,name,weight,height,birth_year,gender,city,nick_name,full_name
0,Anna,45.2,155,2000,female,New York,Anna,Anna Levis
1,Dane,50.5,160,1997,male,Chicago,Dane,Dane Sebastian
2,David,62.1,162,1996,male,Austin,David,David John
3,Kevin,64.0,170,1987,male,New York,NaN,NaN
4,Joe,59.0,167,1998,male,NaN,NaN,NaN
5,Rose,NaN,159,2003,female,New York,Rose,Rose Kimberly

###3. 
Drop nick_name column and fill null values in the full_name from the merged DataFrame with their original name column.

menghapus colom nick name pada tabel

In [12]:
df4 = df3.drop(columns = "nick_name")
df4

    name  weight  height  birth_year  gender      city       full_name
0   Anna    45.2     155        2000  female  New York      Anna Levis
1   Dane    50.5     160        1997    male   Chicago  Dane Sebastian
2  David    62.1     162        1996    male    Austin      David John
3  Kevin    64.0     170        1987    male  New York             NaN
4    Joe    59.0     167        1998    male       NaN             NaN
5   Rose     NaN     159        2003  female  New York   Rose Kimberly

mengisi tabel kosong pada full name menggunakan name

In [ ]:
df4["full_name"] = df4["full_name"].fillna(df4["name"])
df4

    name  weight  height  birth_year  gender      city       full_name
0   Anna    45.2     155        2000  female  New York      Anna Levis
1   Dane    50.5     160        1997    male   Chicago  Dane Sebastian
2  David    62.1     162        1996    male    Austin      David John
3  Kevin    64.0     170        1987    male  New York           Kevin
4    Joe    59.0     167        1998    male       NaN             Joe
5   Rose     NaN     159        2003  female  New York   Rose Kimberly

mengisi nilai pada weight dengan menggunakan rata-rata weight

In [ ]:
df4["weight"] = df4["weight"].fillna(df4["weight"].mean())
df4

    name  weight  height  birth_year  gender      city       full_name
0   Anna   45.20     155        2000  female  New York      Anna Levis
1   Dane   50.50     160        1997    male   Chicago  Dane Sebastian
2  David   62.10     162        1996    male    Austin      David John
3  Kevin   64.00     170        1987    male  New York           Kevin
4    Joe   59.00     167        1998    male       NaN             Joe
5   Rose   56.16     159        2003  female  New York   Rose Kimberly

###4. 
Create a new bmi column calculated based on the following formula BMI (kg/m^2) = weight / (height/100)^2

membuat bmi kolom dengan rumus (kg/m^2)=weight/(height/100)^2

In [ ]:
def BMI(data):
    return data["weight"] / (data["height"]/100)**2
df4["bmi"] = df4.apply(BMI, axis=1)
df4

,name,weight,height,birth_year,gender,city,full_name,bmi
0,Anna,45.20,155,2000,female,New York,Anna Levis,18.813736
1,Dane,50.50,160,1997,male,Chicago,Dane Sebastian,19.726562
2,David,62.10,162,1996,male,Austin,David John,23.662551
3,Kevin,64.00,170,1987,male,New York,Kevin,22.145329
4,Joe,59.00,167,1998,male,NaN,Joe,21.155294
5,Rose,56.16,159,2003,female,New York,Rose Kimberly,22.214311

###5. 
Create a new bmi_class column following the definition in the table below.

membuat tabel bmi class dengan mendefinisikan tabel bmi

In [ ]:
bmi_class = []
for row in df4["bmi"]:
    if row < 18.5 : bmi_class.append("Underweight")
    elif row >= 18.5 and row < 25.0 : bmi_class.append("Normal Weight")
    elif row >= 25.0 and row < 30.0 : bmi_class.append("Overweight")
    elif row >= 30.0 and row < 35.0 : bmi_class.append("Obesity class 1")
    elif row >= 35.0 and row < 40.0 : bmi_class.append("Obesity class 2")        
    elif row > 40.0 : bmi_class.append("Obesity class 3")

In [ ]:
df4["bmi_class"] = bmi_class
df4

,name,weight,height,birth_year,gender,city,full_name,bmi,bmi_class
0,Anna,45.20,155,2000,female,New York,Anna Levis,18.813736,Normal Weight
1,Dane,50.50,160,1997,male,Chicago,Dane Sebastian,19.726562,Normal Weight
2,David,62.10,162,1996,male,Austin,David John,23.662551,Normal Weight
3,Kevin,64.00,170,1987,male,New York,Kevin,22.145329,Normal Weight
4,Joe,59.00,167,1998,male,NaN,Joe,21.155294,Normal Weight
5,Rose,56.16,159,2003,female,New York,Rose Kimberly,22.214311,Normal Weight